//package ch04.sec02;
//
//import java.util.ArrayList;
//import java.util.Scanner;
//
//public class test3
//{
//
//	public static void main(String[] args)
//	{
////===============================================
//		int A = 1;
//		B = 2;
//		int B;
//		B = 2;
////		int c = new int {3};
////===============================================
//		int[] intA1 = { 1, 2, 3, 4, 5 };
////===============================================		
//		int[] intA2 = new int[5];
//		intA2={1,2,3,4,5};
//		intA2[0] = 1;
//		intA2 = new int[] { 1, 2, 3, 4, 5 };
//
//		int intA3 = new int[] { 1, 2, 3, 4, 5 };		
////===============================================	
//		int[][] intB1 = { { 1, 2 }, { 3, 4, 5 } };
////===============================================
//		int[][] intB2 = new int[5][];
//		intB2={1,2,3,4,5};
//		intB2[0] = 1;
//		intB2 = new int[] { 1, 2, 3, 4, 5 };
//		
//		intB2[0]={1,2,3,4,5};
//		intB2[0][0] = 1;
//		intB2[0][0] = { { 1, 2 }, { 3, 4, 5 } };
//		intB2[0] = new int[] { 1, 2, 3, 4, 5 };
//		intB2 = new int[][] { { 1, 2 }, { 3, 4, 5 } };
////===============================================
//		String[] strA1 = {"설동원","백가이","김범용","한우진","박진한"};
//		String[] strA2 = new String[5];
//		strA2 = {"설동원","백가이","김범용","한우진","박진한"};
//		strA2[0] = {"설동원","백가이","김범용","한우진","박진한"};
//		strA2[0] = "설동원";
//		strA2 = new String[]{"설동원","백가이","김범용","한우진","박진한"};
////===============================================		
//		String[][] strB1 = {{"설동원","백가이"},{"김범용","한우진","박진한"}};
//		
//		String[][] strB2 = new String[5][];
//		strB2 = {{"설동원","백가이"},{"김범용","한우진","박진한"}};
//		
//		
//		strB2[0] = {{"설동원","백가이"},{"김범용","한우진","박진한"}};
//		strB2[0] = {"설동원","백가이"};
//		strB2[0][0] = {"설동원","백가이"};
////		strB2[0] = new String[]{"설동원","백가이"};
////===============================================
//		StudentScore[] ssArray = new StudentScore[5];
//		for (int i = 0; i < ssArray.length; i++)
//		{
//		ssArray[i] = new StudentScore("이름", 0, i, i, i, i);
//		}
//		
//		intseol num = new intseol(1143455444);
//	}
//
//}
